app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Kim"], ["updated_at", "2020-02-26 01:25:18.277463"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)